benchmark_results/20260202_233218/test1_tweets_page1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /tweets?count=20&cursor=0
Document Length:        5359 bytes

Concurrency Level:      10
Time taken for tests:   0.016 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      97
Total transferred:      26993 bytes
HTML transferred:       12970 bytes
Requests per second:    6116.96 [#/sec] (mean)
Time per request:       1.635 [ms] (mean)
Time per request:       0.163 [ms] (mean, across all concurrent requests)
Transfer rate:          1612.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    1   1.1      0       9
Waiting:        0    0   1.1      0       8
Total:          0    1   1.1      1       9

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      8
  99%      9
 100%      9 (longest request)